[Survived] ArrowFunction
src/App.tsx:41:34
   children: React.ReactNode;
 }
 
-const Header: FC<IHeaderProps> = ({ children }) => (
-  <header className="App-header">
-    <img src={reactLogo} alt="logo" className="App-logo" />
-    {children}
-  </header>
-);
+const Header: FC<IHeaderProps> = () => undefined;
 
 interface ILinkProps {

[Survived] ArrowFunction
src/App.tsx:55:30
   rel?: string;
 }
 
-const Link: FC<ILinkProps> = ({ children, ...restProps }) => (
-  <a {...restProps}>{children}</a>
-);
+const Link: FC<ILinkProps> = () => undefined;
 
 Link.defaultProps = {

[Survived] StringLiteral
src/App.tsx:60:11
 );
 
 Link.defaultProps = {
-  target: "_blank",
+  target: "",
   rel: "noopener noreferrer",
 };

[Survived] StringLiteral
src/App.tsx:61:8
 
 Link.defaultProps = {
   target: "_blank",
-  rel: "noopener noreferrer",
+  rel: "",
 };
 
