[NoCoverage] BlockStatement
src/components/ScoreBoard/Level.tsx:10:49
   children: string[];
 }
 
-const Level: FC<LevelProps> = ({ children }) => {
-  return (
-    <select className="m-0 h-[2.5vw] rounded-none border-[0.15vw] border-gray-300 bg-gray-400">
-      {children.map((item: string) => (
-        <option
-          key={item}
-          value={item}
-          className="font-normal block  whitespace-nowrap min-h-[1.2em] pt-0 px-[0.2vw] pb-[0.2vw]"
-        >
-          {item}
-        </option>
-      ))}
-    </select>
-  );
-};
+const Level: FC<LevelProps> = ({ children }) => {};
 
 export default Level;

[NoCoverage] ArrowFunction
src/components/ScoreBoard/Level.tsx:13:21
 const Level: FC<LevelProps> = ({ children }) => {
   return (
     <select className="m-0 h-[2.5vw] rounded-none border-[0.15vw] border-gray-300 bg-gray-400">
-      {children.map((item: string) => (
-        <option
-          key={item}
-          value={item}
-          className="font-normal block  whitespace-nowrap min-h-[1.2em] pt-0 px-[0.2vw] pb-[0.2vw]"
-        >
-          {item}
-        </option>
-      ))}
+      {children.map(() => undefined)}
     </select>
   );
