[NoCoverage] BlockStatement
src/components/ScoreBoard/ScoreBoard.tsx:25:79
   mines: string;
 }
 
-const ScoreBoard: FC<ScoreBoardProps> = ({ time, levels, onReset, mines }) => {
-  return (
-    <div className="wrapper flex w-max pb-[2vw] justify-between">
-      <Counter>{time}</Counter>
-      <Level>{levels}</Level>
-      <Reset onReset={onReset} />
-      <Counter>{mines}</Counter>
-    </div>
-  );
-};
+const ScoreBoard: FC<ScoreBoardProps> = ({ time, levels, onReset, mines }) => {};
 
 export default ScoreBoard;
