[NoCoverage] BlockStatement
src/components/Top/Top.tsx:7:69
 
 export type TopComponentType = LegendProps & GameNameProps;
 
-const Top: FC<TopComponentType> = ({ children, ...legendProps }) => {
-  return (
-    <header className="text-center relative inline-block">
-      <GameName>{children}</GameName>
-      <Legend {...legendProps} />
-    </header>
-  );
-};
+const Top: FC<TopComponentType> = ({ children, ...legendProps }) => {};
 
 export default Top;
