[NoCoverage] StringLiteral
src/main.tsx:7:45
 import Top from "./components/Top/Top.tsx";
 import ScoreBoard from "./components/ScoreBoard/ScoreBoard.tsx";
 
-ReactDOM.createRoot(document.getElementById("root")!).render(
+ReactDOM.createRoot(document.getElementById("")!).render(
   <React.StrictMode>
     <Top feature="Flag" firstAction="Ctrl" secondAction="Click">

[NoCoverage] StringLiteral
src/main.tsx:14:44
     </Top>
     <ScoreBoard
       time="000"
-      levels={["beginner", "intermediate", "expert"]}
+      levels={["beginner", "intermediate", ""]}
       onReset={function (): void {
         throw new Error("Function not implemented.");

[NoCoverage] StringLiteral
src/main.tsx:14:16
     </Top>
     <ScoreBoard
       time="000"
-      levels={["beginner", "intermediate", "expert"]}
+      levels={["", "intermediate", "expert"]}
       onReset={function (): void {
         throw new Error("Function not implemented.");

[NoCoverage] BlockStatement
src/main.tsx:15:34
     <ScoreBoard
       time="000"
       levels={["beginner", "intermediate", "expert"]}
-      onReset={function (): void {
-        throw new Error("Function not implemented.");
-      }}
+      onReset={function (): void {}}
       mines="010"
     />

[NoCoverage] StringLiteral
src/main.tsx:16:25
       time="000"
       levels={["beginner", "intermediate", "expert"]}
       onReset={function (): void {
-        throw new Error("Function not implemented.");
+        throw new Error("");
       }}
       mines="010"
