[Killed] ArrowFunction
src/components/Grid/Cell.tsx:27:29
   onContextMenu: (coords: Coords) => void;
 }
 
-export const isActiveCell = (cell: CellType): boolean =>
-  [CellState.hidden, CellState.flag, CellState.weakFlag].includes(cell);
+export const isActiveCell = () => undefined;
 
 export const areEqual = (
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Array [

[Killed] BlockStatement
src/components/Grid/Cell.tsx:33:15
 export const areEqual = (
   prevProps: CellProps,
   nextProps: CellProps,
-): boolean => {
-  const areEqualCoords =
-    prevProps.coords.filter((coord, idx) => nextProps.coords[idx] !== coord)
-      .length === 0;
-
-  return (
-    prevProps.children === nextProps.children &&
-    areEqualCoords &&
-    prevProps.onClick === nextProps.onClick &&
-    prevProps.onContextMenu === nextProps.onContextMenu
-  );
-};
+): boolean => {};
 
 export const Cell: FC<CellProps> = memo(({ children, coords, ...rest }) => {
killedBy: Cell component check Check areEqual
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/components/Grid/Cell.tsx:35:45
   nextProps: CellProps,
 ): boolean => {
   const areEqualCoords =
-    prevProps.coords.filter((coord, idx) => nextProps.coords[idx] !== coord)
+    prevProps.coords.filter((coord, idx) => nextProps.coords[idx] === coord)
       .length === 0;
 
killedBy: Cell component check Check areEqual
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/components/Grid/Cell.tsx:35:5
   nextProps: CellProps,
 ): boolean => {
   const areEqualCoords =
-    prevProps.coords.filter((coord, idx) => nextProps.coords[idx] !== coord)
+    prevProps.coords
       .length === 0;
 
killedBy: Cell component check Check areEqual
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/components/Grid/Cell.tsx:39:5
       .length === 0;
 
   return (
-    prevProps.children === nextProps.children &&
-    areEqualCoords &&
-    prevProps.onClick === nextProps.onClick &&
-    prevProps.onContextMenu === nextProps.onContextMenu
+    prevProps.children === nextProps.children && areEqualCoords && prevProps.onClick === nextProps.onClick || prevProps.onContextMenu === nextProps.onContextMenu
   );
 };
killedBy: Cell component check Check areEqual
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/components/Grid/Cell.tsx:39:5
       .length === 0;
 
   return (
-    prevProps.children === nextProps.children &&
-    areEqualCoords &&
-    prevProps.onClick === nextProps.onClick &&
+    prevProps.children === nextProps.children && areEqualCoords || prevProps.onClick === nextProps.onClick &&
     prevProps.onContextMenu === nextProps.onContextMenu
   );
killedBy: Cell component check Check areEqual
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:41:5
   return (
     prevProps.children === nextProps.children &&
     areEqualCoords &&
-    prevProps.onClick === nextProps.onClick &&
+    true &&
     prevProps.onContextMenu === nextProps.onContextMenu
   );
killedBy: Cell component check Check areEqual
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/components/Grid/Cell.tsx:41:5
   return (
     prevProps.children === nextProps.children &&
     areEqualCoords &&
-    prevProps.onClick === nextProps.onClick &&
+    prevProps.onClick !== nextProps.onClick &&
     prevProps.onContextMenu === nextProps.onContextMenu
   );
killedBy: Cell component check Check areEqual
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/components/Grid/Cell.tsx:42:5
     prevProps.children === nextProps.children &&
     areEqualCoords &&
     prevProps.onClick === nextProps.onClick &&
-    prevProps.onContextMenu === nextProps.onContextMenu
+    prevProps.onContextMenu !== nextProps.onContextMenu
   );
 };
killedBy: Cell component check Check areEqual
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:42:5
     prevProps.children === nextProps.children &&
     areEqualCoords &&
     prevProps.onClick === nextProps.onClick &&
-    prevProps.onContextMenu === nextProps.onContextMenu
+    true
   );
 };
killedBy: Cell component check Check areEqual
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/components/Grid/Cell.tsx:51:70
 
   const onClick = () => rest.onClick(coords);
 
-  const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {
-    /**
-     * Prevent context menu by default
-     */
-    event.preventDefault();
-
-    if (isActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
-  };
+  const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {};
 
   const props = {
killedBy: Cell component check Check prevent default contextMenu for every type of cell
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/Grid/Cell.tsx:57:33
      */
     event.preventDefault();
 
-    if (isActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
+    if (isActiveCell(children)) {}
   };
 
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:57:9
      */
     event.preventDefault();
 
-    if (isActiveCell(children)) {
+    if (false) {
       rest.onContextMenu(coords);
     }
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: expected "spy" to be called at least once

[Killed] StringLiteral
src/components/Grid/Cell.tsx:70:11
     onMouseLeave: onMouseUp,
     mouseDown,
     "data-testid": `${coords}`,
-    role: "cell",
+    role: "",
   };
 
killedBy: Cell component check Cell renders correct
statusReason: Snapshot `Cell component check > Cell renders correct 1` mismatched

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:99:5
   };
 
   switch (children) {
-    case CellState.bomb:
-      return (
-        <BombFrame {...nonActiveCellProps}>
-          <Bomb data-testid={`bomb_${rest["data-testid"]}`} />
-        </BombFrame>
-      );
+    case CellState.bomb:
     case CellState.hidden:
       return <ClosedFrame {...rest}>{children}</ClosedFrame>;
killedBy: Cell component check Cell renders correct; Grid renders correctly
statusReason: Snapshot `Cell component check > Cell renders correct 10` mismatched

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:105:5
           <Bomb data-testid={`bomb_${rest["data-testid"]}`} />
         </BombFrame>
       );
-    case CellState.hidden:
-      return <ClosedFrame {...rest}>{children}</ClosedFrame>;
+    case CellState.hidden:
     case CellState.flag:
       return (
killedBy: Cell component check Cell renders correct
statusReason: Snapshot `Cell component check > Cell renders correct 11` mismatched

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:107:5
       );
     case CellState.hidden:
       return <ClosedFrame {...rest}>{children}</ClosedFrame>;
-    case CellState.flag:
-      return (
-        <ClosedFrame {...rest}>
-          <Flag data-testid={`flag_${rest["data-testid"]}`}>{children}</Flag>
-        </ClosedFrame>
-      );
+    case CellState.flag:
     case CellState.weakFlag:
       return (
killedBy: Cell component check Cell renders correct
statusReason: Snapshot `Cell component check > Cell renders correct 12` mismatched

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:113:5
           <Flag data-testid={`flag_${rest["data-testid"]}`}>{children}</Flag>
         </ClosedFrame>
       );
-    case CellState.weakFlag:
-      return (
-        <ClosedFrame {...rest}>
-          <WeakFlag data-testid={`weakFlag_${rest["data-testid"]}`} />
-        </ClosedFrame>
-      );
+    case CellState.weakFlag:
     default:
       return <RevealedFrame {...nonActiveCellProps}>{children}</RevealedFrame>;
killedBy: Cell component check Cell renders correct
statusReason: Snapshot `Cell component check > Cell renders correct 13` mismatched

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:119:5
           <WeakFlag data-testid={`weakFlag_${rest["data-testid"]}`} />
         </ClosedFrame>
       );
-    default:
-      return <RevealedFrame {...nonActiveCellProps}>{children}</RevealedFrame>;
+    default:
   }
 };
killedBy: Cell component check Cell renders correct
statusReason: Snapshot `Cell component check > Cell renders correct 1` mismatched

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:139:19
   color: transparent;
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
-  border-color: ${({ mouseDown = false }) =>
-    mouseDown ? "transparent" : "white #9e9e9e #9e9e9e white"};
+  border-color: ${() => undefined};
   &:hover {
     filter: brightness(1.1);
killedBy: Grid renders correctly; Cell component check Cell renders correct
statusReason: Snapshot `Grid renders correctly 1` mismatched

[Killed] StringLiteral
src/components/Grid/Cell.tsx:146:21
   }
 `;
 
-const transparent = "rgba(0,0,0,0)";
+const transparent = "";
 const colors: { [key in CellType]: string } = {
   0: transparent,
killedBy: Cell component check Cell renders correct
statusReason: Snapshot `Cell component check > Cell renders correct 1` mismatched

[Killed] StringLiteral
src/components/Grid/Cell.tsx:155:6
   4: "#233db7",
   5: "#a6070f",
   6: "#e400af",
-  7: "#906a02",
+  7: "",
   8: "#fa0707",
   9: transparent,
killedBy: Cell component check Cell renders correct
statusReason: Snapshot `Cell component check > Cell renders correct 8` mismatched

[Killed] StringLiteral
src/components/Grid/Cell.tsx:172:24
   }
 `;
 
-const Bomb = styled.div`
-  border-radius: 50%;
-  width: 1vh;
-  height: 1vh;
-  background-color: #333;
-`;
+const Bomb = styled.div``;
 
 const BombFrame = styled(RevealedFrame)`
killedBy: Cell component check Cell renders correct; Grid renders correctly
statusReason: Snapshot `Cell component check > Cell renders correct 10` mismatched

[Killed] StringLiteral
src/components/Grid/Cell.tsx:192:30
   border-left: 0.5vh solid #ec433c;
 `;
 
-const WeakFlag = styled(Flag)`
-  border-left: 0.5vh solid #f19996;
-`;
+const WeakFlag = styled(Flag)``;
 
killedBy: Cell component check Cell renders correct
statusReason: Snapshot `Cell component check > Cell renders correct 13` mismatched
