[Killed] ArrowFunction
src/components/Grid/Grid.tsx:23:36
   onContextMenu: (coords: Coords) => void;
 }
 
-export const Grid: FC<GridProps> = ({ children, ...rest }) => (
-  <Wrapper size={children.length} role="grid">
-    {children.map((row, y) =>
-      row.map((cell, x) => (
-        // Stryker disable next-line StringLiteral
-        <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </Cell>
-      )),
-    )}
-  </Wrapper>
-);
+export const Grid: FC<GridProps> = () => undefined;
 
 interface WrapperProps {
killedBy: Grid renders correctly
statusReason: Snapshot `Grid renders correctly 1` mismatched

[Killed] ArrowFunction
src/components/Grid/Grid.tsx:25:19
 
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length} role="grid">
-    {children.map((row, y) =>
-      row.map((cell, x) => (
-        // Stryker disable next-line StringLiteral
-        <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </Cell>
-      )),
+    {children.map(() => undefined,
     )}
   </Wrapper>
killedBy: Grid renders correctly
statusReason: Snapshot `Grid renders correctly 1` mismatched

[Killed] ArrowFunction
src/components/Grid/Grid.tsx:26:15
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length} role="grid">
     {children.map((row, y) =>
-      row.map((cell, x) => (
-        // Stryker disable next-line StringLiteral
-        <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </Cell>
-      )),
+      row.map(() => undefined),
     )}
   </Wrapper>
killedBy: Grid renders correctly
statusReason: Snapshot `Grid renders correctly 1` mismatched
