[Killed] ArrowFunction
src/helpers/Field.ts:28:46
  * @param {Cell} state
  * @returns {Field}
  */
-export const generateFieldWithDefaultState = (
-  size: number,
-  state: Cell = CellState.empty,
-): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
+export const generateFieldWithDefaultState = () => undefined;
 
 /**
killedBy: Field Generator emptyFieldGenerator tests 2x2
statusReason: expected undefined to strictly equal [ [ +0, +0 ], [ +0, +0 ] ]

[Killed] BlockStatement
src/helpers/Field.ts:52:77
  * @param {number} probability
  * @returns {Field}
  */
-export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
-    throw new Error("Probability must be between 0 and 1");
-  }
-
-  let unprocessedCells = size * size;
-  let restCellsWithBombs = unprocessedCells * probability;
-
-  const result: Field = generateFieldWithDefaultState(size);
-
-  // Stryker disable next-line EqualityOperator
-  for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeighbours([y, x], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
-  return result;
-};
+export const fieldGenerator = (size: number, probability: number): Field => {};
 
killedBy: Field Generator Simple cases Wrong dencity
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/helpers/Field.ts:53:26
  * @returns {Field}
  */
 export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
+  if (probability < 0 || false) {
     throw new Error("Probability must be between 0 and 1");
   }
killedBy: Field Generator Simple cases Wrong dencity
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/helpers/Field.ts:53:26
  * @returns {Field}
  */
 export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
+  if (probability < 0 || probability >= 1) {
     throw new Error("Probability must be between 0 and 1");
   }
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Probability must be between 0 and 1

[Killed] StringLiteral
src/helpers/Field.ts:54:21
  */
 export const fieldGenerator = (size: number, probability: number): Field => {
   if (probability < 0 || probability > 1) {
-    throw new Error("Probability must be between 0 and 1");
+    throw new Error("");
   }
 
killedBy: Field Generator Simple cases Wrong dencity
statusReason: expected [Function] to throw error including 'Probability must be between 0 and 1' but got ''

[Killed] ArithmeticOperator
src/helpers/Field.ts:58:28
   }
 
   let unprocessedCells = size * size;
-  let restCellsWithBombs = unprocessedCells * probability;
+  let restCellsWithBombs = unprocessedCells / probability;
 
   const result: Field = generateFieldWithDefaultState(size);
killedBy: Field Generator Simple cases Smallest possible field without mine
statusReason: expected [ [ 9 ] ] to strictly equal [ [ +0 ] ]

[Killed] BlockStatement
src/helpers/Field.ts:63:34
   const result: Field = generateFieldWithDefaultState(size);
 
   // Stryker disable next-line EqualityOperator
-  for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeighbours([y, x], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
+  for (let y = 0; y < size; y++) {}
   return result;
 };
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: expected [ [ +0 ] ] to strictly equal [ [ 9 ] ]

[Killed] ConditionalExpression
src/helpers/Field.ts:63:19
   const result: Field = generateFieldWithDefaultState(size);
 
   // Stryker disable next-line EqualityOperator
-  for (let y = 0; y < size; y++) {
+  for (let y = 0; false; y++) {
     for (let x = 0; x < size; x++) {
       // Stryker disable next-line EqualityOperator
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: expected [ [ +0 ] ] to strictly equal [ [ 9 ] ]

[Killed] EqualityOperator
src/helpers/Field.ts:64:21
 
   // Stryker disable next-line EqualityOperator
   for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
+    for (let x = 0; x <= size; x++) {
       // Stryker disable next-line EqualityOperator
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
killedBy: Field Generator Simple cases 2x2 field with mines
statusReason: expected [ [ 9, 9, 9 ], [ 9, 4 ] ] to strictly equal [ [ 9, 9 ], [ 9, 9 ] ]

[Killed] BlockStatement
src/helpers/Field.ts:64:36
 
   // Stryker disable next-line EqualityOperator
   for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeighbours([y, x], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
+    for (let x = 0; x < size; x++) {}
   }
   return result;
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: expected [ [ +0 ] ] to strictly equal [ [ 9 ] ]

[Killed] ArithmeticOperator
src/helpers/Field.ts:66:11
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
       // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (restCellsWithBombs * unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
         incrementNeighbours([y, x], result);
killedBy: Field Generator Simple cases Real game field size = 10x10 with 1/4 mined cells (25 mines)
statusReason: expected '99999999999999999999' not to be '99999999999999999999' // Object.is equality

[Killed] ConditionalExpression
src/helpers/Field.ts:66:11
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
       // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (true) {
         result[y][x] = CellState.bomb;
         incrementNeighbours([y, x], result);
killedBy: Field Generator Simple cases Smallest possible field without mine
statusReason: expected [ [ 9 ] ] to strictly equal [ [ +0 ] ]

[Killed] UpdateOperator
src/helpers/Field.ts:69:9
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
         incrementNeighbours([y, x], result);
-        restCellsWithBombs--;
+        restCellsWithBombs++;
       }
       unprocessedCells--;
killedBy: Field Generator Simple cases 2x2 field with 50% probability
statusReason: expected [ 9, 9, 9, 9 ] to have a length of 2 but got 4
