[Killed] BlockStatement
src/hooks/useMouseDown.ts:10:6
   boolean,
   SetMouseDownStatus,
   SetMouseUpStatus,
-] => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  const onMouseDown = useCallback(
-    () => setMouseDown(true),
-    // Stryker disable next-line ArrayDeclaration
-    [],
-  );
-  const onMouseUp = useCallback(
-    () => setMouseDown(false),
-    // Stryker disable next-line ArrayDeclaration
-    [],
-  );
-
-  return [mouseDown, onMouseDown, onMouseUp];
-};
+] => {};
 
killedBy: useMousedown hook test Should toggle state after onMouseDown/onMouseUp calls
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BooleanLiteral
src/hooks/useMouseDown.ts:11:46
   SetMouseDownStatus,
   SetMouseUpStatus,
 ] => {
-  const [mouseDown, setMouseDown] = useState(false);
+  const [mouseDown, setMouseDown] = useState(true);
 
   const onMouseDown = useCallback(
killedBy: useMousedown hook test Should toggle state after onMouseDown/onMouseUp calls
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/useMouseDown.ts:14:24
   const [mouseDown, setMouseDown] = useState(false);
 
   const onMouseDown = useCallback(
-    () => setMouseDown(true),
+    () => setMouseDown(false),
     // Stryker disable next-line ArrayDeclaration
     [],
killedBy: useMousedown hook test Should toggle state after onMouseDown/onMouseUp calls
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/hooks/useMouseDown.ts:14:5
   const [mouseDown, setMouseDown] = useState(false);
 
   const onMouseDown = useCallback(
-    () => setMouseDown(true),
+    () => undefined,
     // Stryker disable next-line ArrayDeclaration
     [],
killedBy: useMousedown hook test Should toggle state after onMouseDown/onMouseUp calls
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/useMouseDown.ts:19:24
     [],
   );
   const onMouseUp = useCallback(
-    () => setMouseDown(false),
+    () => setMouseDown(true),
     // Stryker disable next-line ArrayDeclaration
     [],
killedBy: useMousedown hook test Should toggle state after onMouseDown/onMouseUp calls
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/hooks/useMouseDown.ts:19:5
     [],
   );
   const onMouseUp = useCallback(
-    () => setMouseDown(false),
+    () => undefined,
     // Stryker disable next-line ArrayDeclaration
     [],
killedBy: useMousedown hook test Should toggle state after onMouseDown/onMouseUp calls
statusReason: expected true to be false // Object.is equality
