[Killed] BlockStatement
src/components/ScoreBoard/Reset.tsx:10:48
   onReset: () => void;
 }
 
-const Reset: FC<ResetProps> = ({ onReset }) => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  const onMouseDown = () => {
-    setMouseDown(true);
-  };
-  const onMouseUp = () => {
-    setMouseDown(false);
-  };
-
-  return (
-    <button
-      onMouseDown={onMouseDown}
-      onMouseLeave={onMouseUp}
-      onMouseUp={onMouseUp}
-      onClick={onReset}
-      className="text-[2vw] cursor-pointer font-bold border-[0.15vw] bg-gray-300"
-    >
-      {mouseDown ? "😯" : "🙂"}
-    </button>
-  );
-};
+const Reset: FC<ResetProps> = ({ onReset }) => {};
 
 export default Reset;
killedBy: Reset button check Should renders with default state
statusReason: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/components/ScoreBoard/Reset.tsx:11:46
 }
 
 const Reset: FC<ResetProps> = ({ onReset }) => {
-  const [mouseDown, setMouseDown] = useState(false);
+  const [mouseDown, setMouseDown] = useState(true);
 
   const onMouseDown = () => {
killedBy: Reset button check Should renders with default state
statusReason: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="text-[2vw] cursor-pointer font-bold border-[0.15vw] bg-gray-300"
    >

[Killed] BlockStatement
src/components/ScoreBoard/Reset.tsx:13:29
 const Reset: FC<ResetProps> = ({ onReset }) => {
   const [mouseDown, setMouseDown] = useState(false);
 
-  const onMouseDown = () => {
-    setMouseDown(true);
-  };
+  const onMouseDown = () => {};
   const onMouseUp = () => {
     setMouseDown(false);
killedBy: Reset button check Should change state when onMouseDown and onMouseUp events happened
statusReason: Unable to find an element with the text: 😯. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="text-[2vw] cursor-pointer font-bold border-[0.15vw] bg-gray-300"
    >

[Killed] BooleanLiteral
src/components/ScoreBoard/Reset.tsx:14:18
   const [mouseDown, setMouseDown] = useState(false);
 
   const onMouseDown = () => {
-    setMouseDown(true);
+    setMouseDown(false);
   };
   const onMouseUp = () => {
killedBy: Reset button check Should change state when onMouseDown and onMouseUp events happened
statusReason: Unable to find an element with the text: 😯. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="text-[2vw] cursor-pointer font-bold border-[0.15vw] bg-gray-300"
    >

[Killed] BlockStatement
src/components/ScoreBoard/Reset.tsx:16:27
   const onMouseDown = () => {
     setMouseDown(true);
   };
-  const onMouseUp = () => {
-    setMouseDown(false);
-  };
+  const onMouseUp = () => {};
 
   return (
killedBy: Reset button check Should change state when onMouseDown and onMouseUp events happened
statusReason: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="text-[2vw] cursor-pointer font-bold border-[0.15vw] bg-gray-300"
    >

[Killed] BooleanLiteral
src/components/ScoreBoard/Reset.tsx:17:18
     setMouseDown(true);
   };
   const onMouseUp = () => {
-    setMouseDown(false);
+    setMouseDown(true);
   };
 
killedBy: Reset button check Should change state when onMouseDown and onMouseUp events happened
statusReason: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      class="text-[2vw] cursor-pointer font-bold border-[0.15vw] bg-gray-300"
    >
