[Killed] ArrowFunction
src/helpers/CellsManipulator.ts:8:35
  * @param {Coords} coords
  * @returns {Record<string, [number, number]>}
  */
-export const getNeighboursItems = ([y, x]: Coords): Record<
-  string,
-  [number, number]
-> => ({
-  top: [y - 1, x],
-  topRight: [y - 1, x + 1],
-  right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
-});
+export const getNeighboursItems = () => undefined;
 
 /**
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: expected undefined to strictly equal { top: [ -1, +0 ], …(7) }

[Killed] ArithmeticOperator
src/helpers/CellsManipulator.ts:12:9
   string,
   [number, number]
 > => ({
-  top: [y - 1, x],
+  top: [y + 1, x],
   topRight: [y - 1, x + 1],
   right: [y, x + 1],
killedBy: Field Generator Simple cases 2x2 field with 50% probability; Check neigbours selectors With [0, 0] coords
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrayDeclaration
src/helpers/CellsManipulator.ts:14:10
 > => ({
   top: [y - 1, x],
   topRight: [y - 1, x + 1],
-  right: [y, x + 1],
+  right: [],
   rightBottom: [y + 1, x + 1],
   bottom: [y + 1, x],
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: expected { top: [ -1, +0 ], …(7) } to strictly equal { top: [ -1, +0 ], …(7) }

[Killed] ArrayDeclaration
src/helpers/CellsManipulator.ts:18:9
   rightBottom: [y + 1, x + 1],
   bottom: [y + 1, x],
   bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
+  left: [],
   leftTop: [y - 1, x - 1],
 });
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: expected { top: [ -1, +0 ], …(7) } to strictly equal { top: [ -1, +0 ], …(7) }

[Killed] ArrowFunction
src/helpers/CellsManipulator.ts:28:33
  * @param {Field} field
  * @returns {boolean}
  */
-export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+export const checkItemInField = () => undefined;
 
 /**
killedBy: Field Generator Simple cases 2x2 field with 50% probability
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:29:3
  * @returns {boolean}
  */
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y > 0 && x >= 0 && length - y > 0 && length - x > 0;
 
 /**
killedBy: checkItemInField tests Simple cases In x and y range
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:29:3
  * @returns {boolean}
  */
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  true;
 
 /**
killedBy: checkItemInField tests Simple cases Out of y range
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:37:77
  * @param {Field} field
  * @returns {Cell}
  */
-export const incrementNeighbours = (coords: Coords, field: Field): Field => {
-  const items = getNeighboursItems(coords);
-
-  for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
-
-  return field;
-};
+export const incrementNeighbours = (coords: Coords, field: Field): Field => {};
 
killedBy: Check Increment Neibours Simple cases Field with only one item
statusReason: expected undefined to strictly equal [ [ 9 ] ]

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:40:46
 export const incrementNeighbours = (coords: Coords, field: Field): Field => {
   const items = getNeighboursItems(coords);
 
-  for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
+  for (const [y, x] of Object.values(items)) {}
 
   return field;
killedBy: Check Increment Neibours Simple cases Field 2x2 with one mine
statusReason: expected [ [ 9, +0 ], [ +0, +0 ] ] to strictly equal [ [ 9, 1 ], [ 1, 1 ] ]

[Killed] BlockStatement
src/helpers/CellsManipulator.ts:41:42
   const items = getNeighboursItems(coords);
 
   for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
+    if (checkItemInField([y, x], field)) {}
   }
 
killedBy: Field Generator Simple cases 2x2 field with 50% probability; Check Increment Neibours Simple cases Field 2x2 with one mine
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:41:9
   const items = getNeighboursItems(coords);
 
   for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
+    if (true) {
       const cell = field[y][x];
       if (cell < 8) {
killedBy: Check Increment Neibours Simple cases Field with only one item; Field Generator Simple cases Smallest possible field with mine
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/helpers/CellsManipulator.ts:43:11
   for (const [y, x] of Object.values(items)) {
     if (checkItemInField([y, x], field)) {
       const cell = field[y][x];
-      if (cell < 8) {
+      if (cell >= 8) {
         field[y][x] = (cell + 1) as Cell;
       }
killedBy: Check Increment Neibours Simple cases Field 2x2 with one mine
statusReason: expected [ [ 9, +0 ], [ +0, +0 ] ] to strictly equal [ [ 9, 1 ], [ 1, 1 ] ]

[Killed] ConditionalExpression
src/helpers/CellsManipulator.ts:43:11
   for (const [y, x] of Object.values(items)) {
     if (checkItemInField([y, x], field)) {
       const cell = field[y][x];
-      if (cell < 8) {
+      if (true) {
         field[y][x] = (cell + 1) as Cell;
       }
killedBy: Field Generator Simple cases 2x2 field with mines
statusReason: expected [ [ 12, 11 ], [ 10, 9 ] ] to strictly equal [ [ 9, 9 ], [ 9, 9 ] ]
