[Killed] ArithmeticOperator
src/mathFunctions.ts:1:54
-export const add = (a: number, b: number): number => a + b;
+export const add = (a: number, b: number): number => a - b;
 export const multiply = (a: number, b: number): number => a * b;
 
killedBy: Math functions tests Check add function
statusReason: expected -1 to be 3 // Object.is equality

[Killed] ArrowFunction
src/mathFunctions.ts:1:20
-export const add = (a: number, b: number): number => a + b;
+export const add = () => undefined;
 export const multiply = (a: number, b: number): number => a * b;
 
killedBy: Math functions tests Check add function
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ArrowFunction
src/mathFunctions.ts:2:25
 export const add = (a: number, b: number): number => a + b;
-export const multiply = (a: number, b: number): number => a * b;
+export const multiply = () => undefined;
 
killedBy: Math functions tests Check multiple function
statusReason: expected undefined to be 6 // Object.is equality

[Killed] ArithmeticOperator
src/mathFunctions.ts:2:59
 export const add = (a: number, b: number): number => a + b;
-export const multiply = (a: number, b: number): number => a * b;
+export const multiply = (a: number, b: number): number => a / b;
 
killedBy: Math functions tests Check multiple function
statusReason: expected 0.6666666666666666 to be 6 // Object.is equality
